[
    {
        "Num" : "1",
        "Text": "Print Hello World",
        "Answer": "Hello World",
        "Time": 60
    },
    {
        "Num" : "2",
        "Text": "Let N be an integer. According to Collatz conjecture, N will always converge to 1 if it is iterated in the following manner: N = N/2 if N is even, N = 3n+1 if N is odd. Example: for N=3, sequence of numbers generated by Collatz conjecture are 10, 5, 16, 8, 4, 2, 1 (total iterations: 7) Your task is to find the number of iterations it will take for N=257 to converge to 1 according to Collatz conjecture.",
        "Answer": 122,
        "Time": 600
    },
    {
        "Num" : "3",
        "Text": "Engineers are working on a new electric train project that will connect different parts of Lahore. The train moves in the following way: It accelerates from speed 0 to the maximum speed at the halfway point of the journey and then decelerates gradually from maximum speed to 0 when it reaches its destination. The power consumed, V units, is equal to the speed of the train. The speed increases from 0 to 1 km/h in the first step and after that, it increases by 3 km/h at every step until the maximum speed is reached. Next, the speed immediately starts decreasing by 3 km/h until it reaches 1 km/h, and then 0 at the final step. Train operators know the maximum speed and want you to calculate the power consumed by the train during the journey. Example: If the maximum speed is 16 km/h, then the speed changes as follows 0 1 4 7 10 13 16 13 10 7 4 1 0 Power needed = 0 + 1 + 4 + 7 + 10 + 13 + 16 + 13 + 10 + 7 + 4 + 1 + 0 = 86 units. Task: Calculate the total power needed during a journey in which the train reaches a maximum speed of 211 km/h.",
        "Answer": 14841,
        "Time": 600
        
    },
    {
        "Num" : "4",
        "Text": "Write a program to find Armstrong numbers up to a given positive integer 'n'. Armstrong numbers are special numbers where the sum of their digits, each raised to the power of the number of digits, equals the number itself. For example, 153 is an Armstrong number because 1^3 + 5^3 + 3^3 = 153. Find the next Armstrong number after 153",
        "Answer": 370,
        "Time": 900
    },
    {
        "Num" : "5",
        "Text": "Create a program that takes a lowercase sentence as input and counts the number of vowels and consonants. Vowels are 'a', 'e', 'i', 'o', and 'u', and all other letters are consonants. Run it for the following string 'jdsakjdsbhjfbaskfbashfbdkjfbdkfbdjkzfbadfjhjbkhkmsabgjdfshakfsabvhjfhsajhbdsabkfanhdjgfbzdkjfrheaolkfbhajbhfiaeksnfekjabfaejbhjfa' and enter the number of vowels.",
        "Answer": 22,
        "Time": 600
    },
    {
        "Num" : "6",
        "Text": "Merge the unordered data stored in two 1D arrays and return the median of the merged array: data1 = {12, 61, 13, 3, 27, 19, 22, 55, 77, 89, 93, 45, 21, 2, 50, 65, 9}, data2 = {102, 58, 32, 11, 9, 10, 53, 49, 7, 8, 18, 99, 76, 94, 101, 32, 75, 86, 76, 55, 6, 2}",
        "Answer": 45,
        "Time": 600
    },
    {
        "Num" : "7",
        "Text": "Given two sets of data, provide the 5th element of the new data set which includes the data of both sets but excludes the data values common in both sets. (Set A ∪ Set B) - (Set A ∩ Set B), where Set A = {67, 55, 33, 89, 65, 22, 19, 45, 78, 101, 57, 56, 12, 31, 99, 103, 63, 27, 31, 77, 110, 143, 61, 85} and Set B = {105, 78, 54, 88, 19, 100, 10, 9, 74, 14, 99, 15, 16, 84, 93, 59, 76, 12, 33, 55, 64}",
        "Answer": 16,
        "Time": 600
    },
    {
        "Num" : "8",
        "Text": "A war has erupted. As the commander in chief of your naval forces, it is your responsibility to attack the initial wave of enemy battleships advancing towards you. Your options are limited and you have decided to destroy three of the battleships in the attack. The good news is that due to the impact of destruction, all the battleships within (or on the boundary of) the impact area will also be destroyed. The impact area of each attack has a radius of 20 units. Given the position coordinates of the battleships, you need to determine the maximum number of battleships that can be destroyed (excluding the targeted ships) if the following battleships are attacked. Position coordinates of targeted battleships: A(50, 150), B(90, 80), C(180, 30) {48,193}, {76,62}, {101,83}, {190,45}, {50,202}, {60,66}, {179,55}, {179,43}, {176, 47}, {49,158}, {40, 135}, {80, 190}, {77,63}, {186,52}, {82,66}, {107,81}, {67,139}, {90,60}, {110,78},{63,139}, {105,65}, {190,48} Note: Each destroyed battleship falls in the impact area of only one attack.",
        "Answer": 6,
        "Time": 1200
    },
    {
        "Num" : "9",
        "Text": "Find the number of balanced prime number between 190 and 400. In number theory, a balanced prime is a prime number with equal-sized prime gaps above and below it, so that it is equal to the arithmetic mean of the nearest primes above and below. Or to put it algebraically, given a prime number Pn , where n is its index in the ordered set of prime numbers, Pn = (Pn-1 + Pn+1) / 2 First few balanced prime numbers are 5, 53, 157, 173.. Example: Pn = 5, Pn-1 =3, Pn+1 =7, Pn = (3+7)/2 = 5; Hence, 5 is a balanced prime. ",
        "Answer": 4,
        "Time": 1200
    },
    {
        "Num" : "10",
        "Text": "English is translated to Pig Latin by taking the last letter of every word, moving it to the first of the word and adding 'ay'. 'The quick brown fox' becomes 'eThay kquicay nbroway xfoay '. For the following passage of text, translate it to Pig Latin and find out what is the 50th character.'In this rugged wilderness, ancient forests stretch their arms toward the heavens, their gnarled and mossy branches forming a sanctuary for wildlife. Crystal-clear streams meander through the terrain, and towering mountains dominate the landscape, their peaks catching the sun's warm glow. Seasons bring distinct changes, from the bloom of spring to the fiery hues of autumn. It's a place where nature thrives, inviting exploration and a deep appreciation for the wonder of the natural world.' Remember words do not contain commas or fullstops.",
        "Answer": "nIay sthiay druggeay swildernesay, tancienay sforestay hstretcay rtheiay sarmay dtowaray ethay sheavenay, rtheiay dgnarleay danay ymossay sbrancheay gforminay aay ysanctuaray rfoay ewildlifay. rCrystal-cleaay sstreamay rmeandeay hthrougay ethay nterraiay, danay gtowerinay smountainay edominatay ethay elandscapay, rtheiay speakay gcatchinay ethay ssun'ay mwaray wgloay. sSeasonay gbrinay tdistincay schangeay, mfroay ethay mblooay foay gsprinay otay ethay yfieray shueay foay nautumay. sIt'ay aay eplacay ewheray enaturay sthriveay, ginvitinay nexploratioay danay aay pdeeay nappreciatioay rfoay ethay rwondeay foay ethay lnaturaay dworlay.",
        "Time": 900
    },
    {
        "Num" : "11",
        "Text": "Decrypt  this string “siay sthiay aay ecluay rfoay drounay otway” by writing this pig Latin in normal English",
        "Answer": "is this a clue for round two",
        "Time": 300
    },
    {
        "Num" : "12",
        "Text": "Amicable numbers are two different numbers where the following holds: The first number is equal to the sum of the proper divisors of the second number. The second number is equal to the sum of the proper divisors of the first number. Note that a proper divisor of a number n is a divisor of a number n, excluding n itself. For example, 220 and 284 are amicable numbers. The proper divisors of 220 are 1, 2, 4, 5, 10, 11, 20, 22, 44, 55 and 110; their sum is 284. The proper divisors of 284 are 1, 2, 4, 71 and 142; their sum is 220. Write a program that reads pairs of numbers and decides whether each pair is amicable. Indicate whether the following are amicable. Give your answer in the form 'FFTF' where F is false and T is true. (5020, 5564), (1231, 1278), (2620, 2924)",
        "Answer": "TFT",
        "Time": 900
    },
    {
        "Num" : "13",
        "Text": "A palindrome is a sequence of characters, words or numbers that remains the same when read forwards and backwards. In simple terms, a palindrome string remains the same when its individual characters are reversed. For example, racecar is a palindrome as it will be the same after it has been reversed. Write a code which checks in a long array given below how many strings are palindromes.['dhahfdjbjfdbsDKJBHSAJDFBSJDbahdbhasdbksafbasjfbvjaajvbfjsabfaskbdsahbdhabDJSBFDJASHBJKDsbdfjbjdfhahd' \n 'Sdjfkdklgldskjgkdjfkgbjkdfljgbbgjlfdkjbgkfjdkgjksdlglfdkfjds' \n 'Jdjkwnfkjfhnureahgvijnbeuvneriuhgiurehhuehugoiioguheuhheruighuirenvuebnjivghaerunhfjkenwkjdj'  \n 'Dmwlemvgldfmblkmfkgmbitrjifrrfijrtibmgkfmklbmfdlgvmelwmd' \n] \n Give your answer in the form 'FFTF' where F is false and T is true.",
        "Answer": "FTFT",
        "Time": 900
    }

]